class Translation(object):
    START_TEXT = """
    - مـرحـبـًا بـك عـزيـزي {}🙋
 - في بوت استخـراج لأقوم باستـخراج الأيبـيات
{ Api Id , Api Hash } الأيـبي أيـدي والأيبـي هاش
- التـابع لـ 𝗧𝗲𝗽𝘁𝗵𝗼𝗻 🤍
━━━━━━━━━━━━━━━━━━━━━━━━
يرجى إدخال رقم هاتفك بتنسيق رمز الدولـة 📱
مـثال:      +xxx xxx xxxx
"""
    AFTER_RECVD_CODE_TEXT = """!
يرجى إرسال الرمز الذي تلقيته من تليجرام

يُستخدم هذا الرمز فقط لغرض الحصول على الايبيات لك من my.telegram.org.
"""
    BEFORE_SUCC_LOGIN = "تم استلام الرمز. جارٍ جمع معلومات الصفحة..."
    ERRED_PAGE = """عذرًا! حدث خطأ. يرجى المحاولة باستخدام الطريقة اليدوية.

كيفية الحصول على معرّف التطبيق ومفتاح API يدويًا:

افتح my.telegram.org/auth
قم بتسجيل الدخول إلى حساب Telegram الخاص بك
انقر على قائمة تطوير واجهة برمجة التطبيقات
قم بملء البيانات التالية:
عنوان التطبيق: tgbot
الاسم القصير: tgbot
عنوان URL: (اتركه فارغًا)
المنصة: سطح المكتب
تم
إذا نجحت في الحصول على المعلومات يدويًا، يرجى المحاولة مرة أخرى باستخدام هذا الروبوت"""
    CANCELLED_MESG = "يرجى إرسال /start للبدء مرة اخرى"
    IN_VALID_CODE_PVDED = "الرمز غير صالح"
    IN_VALID_PHNO_PVDED =  " xxx+ رقم الهاتف الذي ادخلته غير صحيح يرجى إرساله بصيغة دولية مـثال"
